In [1]:
import pandas as pd

### replace 함수 사용시 주의할 점
#### - replace 함수 사용하여 문자열을 치환할 경우 아래와 같은 문제점 발생 가능

In [8]:
dict_test = {
    'col1': [1, 2, 3, 4, 5, 6],
    'col2': ['서울특별시', '서울시', '인천광역시', '서울', '부산', '부산광역시']}
df_test = pd.DataFrame(dict_test)
df_test.head()

   col1   col2
0     1  서울특별시
1     2    서울시
2     3  인천광역시
3     4     서울
4     5     부산

#### 칼럼명.replace --> '서울'만 '서울특별시'로

In [9]:
df_test['col2'] = df_test['col2'].replace('서울', '서울특별시')
df_test.head()

   col1   col2
0     1  서울특별시
1     2    서울시
2     3  인천광역시
3     4  서울특별시
4     5     부산

#### 칼럼명.str.replace --> '서울'에 해당되는 모든 문자열을 '서울특별시'로

In [10]:
df_test['col2'] = df_test['col2'].str.replace('서울', '서울특별시')
df_test.head()

   col1      col2
0     1  서울특별시특별시
1     2    서울특별시시
2     3     인천광역시
3     4  서울특별시특별시
4     5        부산

#### 결론: 데이터 전처리 시 주의해서 사용해야 함ㅜㅜ